package com.example.smartcloset_frontend.ui

// category_detail_id から名前へのマッピング
val categoryMap = mapOf(
    0 to "未選択",
    1 to "Tシャツ・カットソー", 2 to "シャツ・ブラウス", 3 to "ビジネスシャツ",
    4 to "ポロシャツ", 5 to "ニット・セーター", 6 to "ベスト",
    7 to "パーカー", 8 to "スウェット", 9 to "カーディガン・ボレロ",
    10 to "アンサンブル", 11 to "ジャージ", 12 to "タンクトップ",
    13 to "キャミソール", 14 to "チューブトップ", 15 to "その他トップス",
    16 to "テーラードジャケット", 17 to "ノーカラージャケット", 18 to "ノーカラーコート",
    19 to "デニムジャケット", 20 to "ライダースジャケット", 21 to "ブルゾン",
    22 to "ミリタリージャケット", 23 to "MA-1", 24 to "ダウンジャケット・コート",
    25 to "モッズコート", 26 to "ピーコート", 27 to "スンカラーコート",
    28 to "トレンチコート", 29 to "チェスターコート", 30 to "ムートンコート",
    31 to "ナイロンジャケット", 32 to "マウンテンパーカー", 33 to "スタジャン",
    34 to "スカジャン", 35 to "セットアップ", 36 to "カバーオール",
    37 to "ポンチョ", 38 to "その他アウター",
    39 to "デニムパンツ", 40 to "カーゴパンツ", 41 to "チノパンツ",
    42 to "スウェットパンツ", 43 to "スラックス", 44 to "その他パンツ",
    45 to "デニムスカート", 46 to "その他スカート"
)

val sizeMap = mapOf(
    0 to "未選択",
    1 to "XS", 2 to "S", 3 to "M", 4 to "L",
    5 to "XL", 6 to "XXL", 7 to "3XL", 8 to "4XL"
)

val colorMap = mapOf(
    0 to "未選択",
    1 to "ホワイト", 2 to "オフホワイト", 3 to "アイボリー",
    4 to "ベージュ", 5 to "ライトベージュ", 6 to "モカ",
    7 to "イエロー", 8 to "オレンジ", 9 to "ピンク",
    10 to "ライトピンク", 11 to "ラベンダー", 12 to "スカイブルー",
    13 to "ライトブルー", 14 to "ミントグリーン", 15 to "ライトグリーン",
    16 to "カーキ", 17 to "グレー", 18 to "チャコールグレー",
    19 to "ブラック"
)

val patternMap = mapOf(
    0 to "未選択",
    1 to "無地", 2 to "ボーダー柄", 3 to "ドット柄",
    4 to "ストライプ柄", 5 to "チェック柄", 6 to "花柄・ボタニカル柄",
    7 to "カモフラージュ柄", 8 to "ペイズリー柄", 9 to "レオパード柄",
    10 to "パイソン柄", 11 to "ゼブラ柄", 12 to "前面プリント",
    13 to "バックプリント", 14 to "ワンポイント", 15 to "ブランドロゴ",
    16 to "レース", 17 to "フリル", 18 to "フリンジ"
)

